Repository: Siiki-89/my_travels
Catalog: *_travels/lib/l10n/app_*.arb
Languages: es, pt

source: Language
es: Idioma
pt: Idioma

# appName
source: My Travels
es: Mis Viajes
pt: Minhas Viagens

# users
source: Travelers
es: Participantes
pt: Participantes

source: Add Traveler
es: Añadir Participante
pt: Adicionar Participante

# travelerNameHint
source: Traveler Name
es: Nombre del Participante
pt: Nome do Participante

# ageHint
source: Age
es: Edad
pt: Idade

# nameRequiredError
source: Traveler name is required.
es: El nombre del participante es obligatorio.
pt: O nome do participante é obrigatório.

# ageRequiredError
source: Please enter a valid age.
es: Por favor, ingrese una edad válida.
pt: Por favor, insira uma idade válida.

# travelerAddedSuccess
source: Traveler added successfully!
es: ¡Participante añadido con éxito!
pt: Participante adicionado com sucesso!

# travelerUpdatedSuccess
source: Traveler updated successfully!
es: ¡Participante actualizado con éxito!
pt: Participante atualizado com sucesso!

# travelerDeletedSuccess
source: Traveler deleted!
es: ¡Participante eliminado!
pt: Participante excluído!

source: Error adding traveler:
es: Error al añadir participante:
pt: Erro ao adicionar participante:

source: Error updating traveler:
es: Error al actualizar participante:
pt: Erro ao atualizar participante:

source: Error deleting traveler:
es: Error al eliminar participante:
pt: Erro ao excluir participante:

source: Error loading travelers:
es: Error al cargar participantes:
pt: Erro ao carregar participantes:

source: No travelers registered.
es: Ningún participante registrado.
pt: Nenhum participante cadastrado.

# confirmDeletionTitle
source: Confirm Deletion
es: Confirmar Eliminación
pt: Confirmar Exclusão

# confirmDeletionContent
source: Are you sure you want to delete {travelerName}?
es: ¿Está seguro de que desea eliminar a {travelerName}?
pt: Tem certeza que deseja excluir {travelerName}?

# cancelButton
source: Cancel
es: Cancelar
pt: Cancelar

# deleteButton
source: Delete
es: Eliminar
pt: Excluir

# saveButton
source: Save
es: Guardar
pt: Salvar

# editButton
source: Edit
es: Editar
pt: Editar

# clearButton
source: Clear
es: Borrar
pt: Limpar

source: Settings
es: Configuración
pt: Configurações

# darkModeTitle
source: Dark Mode
es: Modo Oscuro
pt: Modo Escuro

# darkModeSubtitle
source: Activate or deactivate dark theme
es: Activar o desactivar tema oscuro
pt: Ativar ou desativar o tema escuro

source: Home
es: Inicio
pt: Início

source: Add
es: Agregar
pt: Adicionar

# travelAddTitle
source: Trip title
es: Título del viaje
pt: Título da viagem

# travelAddStartJourneyDateText
source: Start of the journey
es: Inicio del viaje
pt: Inicio da viagem

# travelAddStart
source: Start
es: Inicio
pt: Início

# travelAddFinal
source: End
es: Final
pt: Final

# travelAddTypeLocomotion
source: Type of vehicle
es: Tipo de vehículo
pt: Tipo de veiculo

# vehicleAirplane
source: Airplane
es: Avión
pt: Avião

# vehicleBus
source: Bus
es: Autobús
pt: Ônibus

# vehicleCar
source: Car
es: Coche
pt: Carro

# vehicleCruise
source: Cruise
es: Crucero
pt: Cruzeiro

# vehicleMotorcycle
source: Motorcycle
es: Motocicleta
pt: Moto

# travelAddTrip
source: Travel route
es: Ruta de viaje
pt: Trajeto da viagem

# travelAddStartintPoint
source: Choose starting point...
es: Elegir punto de partida...
pt: Escolha ponto de partida...

# travelAddFinalPoint
source: Inform the destination
es: informar el destino
pt: Informe o destino

# travelAddDecriptionText
source: What will you do here?
es: ¿Qué harás aquí?
pt: O que fará aqui?

# travelAddPointButton
source: Save destination
es: Guardar destino
pt: Salvar destino

# travelAddTypeInterest
source: Group's points of interest
es: Puntos de interés del grupo
pt: Pontos de interesse do grupo

# experienceTitle
source: Choose interests
es: Elige intereses
pt: Escolha os interesses

# experiencePark
source: Park
es: Parque
pt: Parque

# experienceCulinary
source: Culinary
es: Gastronomía
pt: Culinaria

# experienceHistoric
source: Historic Place
es: Lugares históricos
pt: Lugares Historicos

# experienceNature
source: Nature
es: Natureza
pt: Natureza

# experienceShow
source: Show
es: Espectáculo

# travelerToTravelTitle
source: Choose travels
es: Elige viajeros
pt: Escolha os viajantes

# mapAppBarTitle
source: Route
es: Ruta
pt: Percurso

# noTravelersTitle
source: Your Traveler's Catalog
es: Tu catálogo del viajero
pt: Seu Catálogo de Viajantes

# noTravelersSubtitle
source: Add friends and family here...
es: Añade amigos y familiares aquí...
pt: Adicione amigos e familiares aqui...

# travelerManagementHint
source: Manage travelers here. Saved people can be easily added to your future trips.
es: Gestiona viajeros aquí. Puedes añadir fácilmente a tus futuros viajes a las personas guardadas.
pt: Faça o gerenciamento dos viajantes aqui. As pessoas salvas podem ser facilmente adicionadas às suas viagens futuras.

source: Confirm Deletion
es: Confirmar Eliminación
pt: Confirmar Exclusão

source: Are you sure you want to delete
es: ¿Estás seguro de que deseas eliminar?
pt: Tem certeza que deseja excluir

source: Cancel
es: Cancelar
pt: Cancelar

source: Delete
es: Eliminar
pt: Deletar

# noTravelsTitle
source: No trips recorded
es: No hay viajes registrados
pt: Nenhuma viagem registrada

# noTravelsSubtitle
source: Start by adding a destination and build your travel catalog.
es: Comienza agregando un destino y crea tu catálogo de experiencias.
pt: Comece adicionando um destino e monte seu catálogo de experiências.

# travelManagementHint
source: Manage all your trips here. They will be saved and can be viewed or edited anytime.
es: Administra todos tus viajes aquí. Quedarán guardados y podrás revisarlos o editarlos cuando quieras.
pt: Gerencie todas as suas viagens aqui. Elas ficarão salvas e poderão ser consultadas ou editadas sempre que precisar.

# updateHint
source: Update
es: actualizar
pt: Atualizar

# enterName
source: Please enter a name.
es: Por favor, ingrese un nombre.
pt: Por favor, insira um nome.

# enterValidNumber
source: Please enter a valid number.
es: Por favor, ingrese un número válido.
pt: Por favor, insira um número válido.

# enterAge
source: Please enter an age.
es: Por favor, ingrese una edad.
pt: Por favor, insira uma idade.

# homeSearchHint
source: Search by title...
es: buscar por título...
pt: Buscar por título...

# homeButtonExplore
source: Explore
es: Explorar
pt: Explorar

# ageBelowZero
source: Age must be greater than or equal to 0.
es: La edad debe ser mayor o igual a 0.
pt: Idade deve ser maior ou igual a 0.

source: Age above normal.
es: Edad por encima de lo normal.
pt: Idade acima do normal.

# noSearchResults
source: No trips found with that name.
es: No se encontraron viajes con ese nombre.
pt: Nenhuma viagem encontrada com esse nome.

source: Ongoing travels:
es: Viajes en curso:
pt: Viagens em andamento:

source: Completed travels:
es: Viajes completados:
pt: Viagens concluidas:

source: No ongoing travels.
es: No hay viajes en curso.
pt: Nenhuma viagem em andamento.

# noCompletedTravels
source: You haven't completed any travels yet.
es: No has completado ningún viaje.
pt: Não completou nenhuma viagem.

# clearFormTitle
source: Clear Form
es: Limpiar Formulario
pt: Limpar Formulário

# clearFormContent
source: Are you sure you would like to clear all the data?
es: ¿Estás seguro de que te gustaría borrar todos los datos?
pt: Você tem certeza que gostaria de limpar todos os dados?

# clearFormConfirm
source: Clear
es: Limpiar
pt: Limpar

# errorCommentEmpty
source: Please, type something.
es: Por favor, escribe algo.
pt: Por favor, digite algo.

# errorCommentTooLong
source: The comment cannot be longer than 280 characters.
es: El comentario no puede tener más de 280 caracteres.
pt: O comentário não pode ter mais de 280 caracteres.

# errorSelectAuthor
source: Please, select the author of the comment.
es: Por favor, seleccione el autor del comentario.
pt: Por favor, selecione o autor do comentário.

# errorLinkCommentToLocation
source: Please, link the comment to a location on the trip.
es: Por favor, vincule el comentario a un lugar del viaje.
pt: Por favor, vincule o comentário a um local da viagem.

# errorSelectCoverImage
source: Please, select a cover image.
es: Por favor, selecciona una imagen de portada.
pt: Por favor, selecione uma imagem de capa.

# errorChooseTransport
source: Please, choose a transport type.
es: Por favor, elige un tipo de transporte.
pt: Por favor, escolha um tipo de transporte.

# errorAddOneTraveler
source: Add at least one traveler to the trip.
es: Añade al menos un viajero al viaje.
pt: Adicione pelo menos um viajante à viagem.

# errorMinTwoStops
source: The trip must have at least a departure point and a destination.
es: El viaje debe tener al menos un punto de partida y un destino.
pt: A viagem deve ter pelo menos um ponto de partida e um destino.

# errorAllStopsNeedLocation
source: All destinations must have a location filled in.
es: Todos los destinos deben tener una ubicación rellenada.
pt: Todos os destinos devem ter um local preenchido.

# errorAllStopsNeedDates
source: All arrival and departure dates for destinations must be filled in.
es: Todas las fechas de llegada y salida de los destinos deben ser rellenadas.
pt: Todas as datas de chegada e partida dos destinos devem ser preenchidas.

# errorDepartureBeforeArrival
source: A destination's departure date cannot be earlier than its arrival date.
es: La fecha de salida de un destino no puede ser anterior a su fecha de llegada.
pt: A data de partida de um destino não pode ser anterior à data de chegada.

# errorArrivalBeforePreviousDeparture
source: A destination's arrival cannot be before the departure from the previous location.
es: La llegada a un destino no puede ser anterior a la salida del lugar previo.
pt: A chegada em um destino não pode ser antes da partida do local anterior.

# errorTravelerNameTooShort
source: The name must have at least 3 characters.
es: El nombre debe tener al menos 3 caracteres.
pt: O nome deve ter pelo menos 3 caracteres.

# errorTravelerNameTooLong
source: The name cannot exceed 50 characters.
es: El nombre no puede exceder los 50 caracteres.
pt: O nome não pode exceder 50 caracteres.

# errorTravelerAgeInvalid
source: Please, enter a valid age (0-120).
es: Por favor, ingresa una edad válida (0-120).
pt: Por favor, insira uma idade válida (0-120).

# unexpectedErrorOnSave
source: An unexpected error occurred while saving.
es: Ocurrió un error inesperado al guardar.
pt: Ocorreu um erro inesperado ao salvar.

source: Error loading travels.
es: Error al cargar los viajes.
pt: Erro ao carregar viagens.

# titleMinLengthError
source: Title must have at least 3 characters.
es: El título debe tener al menos 3 caracteres.
pt: O título deve ter pelo menos 3 caracteres.

# cropperToolbarTitle
source: Crop Image
es: Recortar Imagen
pt: Recortar Imagem

source: No traveler found.
es: No se encontró ningún viajero.
pt: Nenhum viajante encontrado.

source: Register Traveler
es: Registrar Viajero
pt: Cadastrar Viajante

source: Show map
es: Mostrar mapa
pt: Mostrar mapa

source: Add destination
es: Añadir destino
pt: Adicionar destino

# removeDestinationTooltip
source: Remove destination
es: Eliminar destino
pt: Remover destino

# titleMaxLengthError
source: Title cannot exceed 50 characters.
es: El título no puede exceder los 50 caracteres.
pt: O título não pode exceder 50 caracteres.

# travelSavedSuccess
source: Travel saved successfully!
es: ¡Viaje guardado con éxito!
pt: Viagem salva com sucesso!

# noRouteToShow
source: There is no route to display.
es: No hay ninguna ruta que mostrar.

# languageNameEnglish
source: English
es: Inglés

# languageNamePortuguese
source: Portuguese
es: Portugués

# languageNameSpanish
source: Spanish
es: Español

# nameMinLengthError
source: Name must contain 3 or more letters.
es: El nombre debe contener 3 o más letras.

# noTravelToShow
source: No travel to display.
es: No hay ningún viaje que mostrar.

# deleteTravelTitle
source: Delete Travel
es: Eliminar Viaje

# deleteTravelContent
source: Are you sure you want to permanently delete the trip "{travelTitle}"?
es: ¿Está seguro de que desea eliminar permanentemente el viaje "{travelTitle}"?

source: Participants
es: Participantes

source: Travel Route
es: Ruta del viaje

# comments
source: {count,plural, =0{No comments} =1{1 Comment} other{{count} Comments}}
es: {count,plural, =0{Ningún comentario} =1{1 comentario} other{{count} comentarios}}

source: No comments yet.
es: Aún no hay comentarios.

source: Anonymous
es: Anónimo

# yearsOld
source: {age} years old
es: {age} años

source: Add Comment
es: Añadir comentario

# noImagesToShow
source: No images to display.
es: No hay imágenes para mostrar.

# addImageCommentTitle
source: Add New Photos
es: Añadir Nuevas Fotos

# addImageCommentContent
source: Select photos from your gallery to add to the trip.
es: Selecciona fotos de tu galería para añadir al viaje.

source: General Trip
es: Viaje general

# linkToLocation
source: Link to a location
es: Vincular a un lugar

source: General trip (optional)
es: General del viaje (opcional)

# travelNotFound
source: Travel with ID {travelId} not found.
es: Viaje con ID {travelId} no encontrada.

source: Error loading travel details.
es: Error al cargar los detalles del viaje.

source: Error saving images.
es: Error al guardar las imágenes.

source: Error deleting travel.
es: Error al eliminar el viaje.

# errorUpdatingStatus
source: Error updating travel status.
es: Error al actualizar el estado del viaje.

source: Error generating PDF.
es: Error al generar el PDF.

# saveImagesNoTravelers
source: Cannot save: the trip has no travelers.
es: No se puede guardar: el viaje no tiene participantes.

# saveImagesNoStartPoint
source: Cannot save: the trip has no starting point.
es: No se puede guardar: el viaje no tiene punto de partida.

source: Travel marked as completed!
es: ¡Viaje marcado como completado!

source: Travel reopened.
es: Viaje reabierto.

# errorSavingComment
source: An unexpected error occurred while saving the comment.
es: Ocurrió un error inesperado al guardar el comentario.

# newCommentAppBarTitle
source: Make a comment
es: Hacer un comentario

# travelFor
source: Trip to {title}
es: Viaje a {title}

source: Participant
es: Participante

# selectAuthorHint
source: Select the author of the comment
es: Selecciona el autor del comentario

# travelLocation
source: Trip location
es: Lugar del viaje

# linkToLocationHint
source: Link to a location
es: Vincular a un lugar

source: Comment
es: Comentario

source: Select Photos
es: Seleccionar Fotos

source: Destination not defined
es: Destino no definido

# travelParticipantsTitle
source: Travel Participants
es: Participantes del Viaje

# travelMapTitle
source: Travel Map
es: Mapa del Viaje

# stopPointTitle
source: Stop Point
es: Punto de Parada

# anonymousTraveler
source: Anonymous
es: Anónimo

source: Transportation
es: Transporte

# finalPageQuote1
source: A journey is not measured in miles, but in moments.
es: Un viaje no se mide en millas, sino en momentos.

# finalPageQuote2
source: Each page of this booklet holds more than just landscapes: they are spontaneous smiles, unexpected discoveries, conversations that touched the soul, and silences that spoke more than words.
es: Cada página de este folleto guarda más que paisajes: son sonrisas espontáneas, descubrimientos inesperados, conversaciones que llegaron al alma y silencios que hablaron más que las palabras.
